---
kind: property
id: P:Autodesk.Revit.DB.Visual.MasonryCMU.MasonryCMUPatternHeight
source: html/ac8bb5ac-b398-4162-c728-a682a43fba37.htm
---
# Autodesk.Revit.DB.Visual.MasonryCMU.MasonryCMUPatternHeight Property

The property labeled "Amount" from the "MasonryCMU" schema.

## Syntax (C#)
```csharp
public static string MasonryCMUPatternHeight { get; }
```

## Remarks
This property is of type "AssetPropertyDouble" within the range of "0, 2".